background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }

    overset-1
    {
        patchType       overset;
        type            zeroGradient;
    }

    vessel
    {
        type            calculated;  // Appropriate if the vessel's motion is determined by fluid forces
        value           uniform (0 0 0);
    }

    pendulum
    {
        type            calculated;  // Same consideration as for the vessel
        value           uniform (0 0 0);
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);  // No movement expected at the bottom
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);  // Static inlet boundary
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);  // Static outlet boundary
    }

    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);  // Static atmosphere boundary
    }

    frontAndBack
    {
        type            fixedValue;
        value           uniform (0 0 0);  // Static front and back boundaries
    }
}
// ************************************************************************* //
