background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

vertices
(
    (-6.5 -1.75 -1.0)  // Increased the domain to ensure sufficient space around the overset meshes
    ( 3.5 -1.75 -1.0)
    ( 2.5  1.75 -1.0)
    (-6.5  1.75 -1.0)
    (-6.5 -1.75  1.0)
    ( 3.5 -1.75  1.0)
    ( 3.5  1.75  1.0)
    (-6.5  1.75  1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 18 10) simpleGrading ( 1 1 1 ) // Increased resolution to improve interpolation
);

edges
(
);

boundary
(
    overset-1
    {
        type overset;
        faces ();
    }

    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //