background/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
        maxIter         100;
    }

    "alpha.water.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr  no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    pcorr
    {
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
    }

    yPsi
    {
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }

    "(U|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(UFinal|hFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.0;
    }

    "(k|omega|epsilon|kFinal|epsilonFinal|omegaFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(rho|rhoFinal)"
    {
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    3;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    oversetAdjustPhi    no;
    momentumPredictor   false;

    ddtCorr             yes;
    correctPhi          no;
    checkMeshCourantNo  no;

    moveMeshOuterCorrectors yes;
    turbOnFinalIterOnly no;
    oversetAdjustPhi    no;
}

relaxationFactors
{
    fields
    {
        p_rgh       0.3;  // Relax pressure to improve stability
        p_rghFinal  0.7;  // Slightly higher relaxation for final iteration
    }

    equations
    {
        U           0.7;  // Relax momentum equation for stability
        k           0.7;  // Relax turbulence quantities for stability
        omega       0.7;
        epsilon     0.7;
        "(.*)"      1.0;  // No relaxation for other equations
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
